cask_args appdir: "/Applications"

tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "rbenv/tap"

brew "automake"
brew "openssl@1.1"
brew "python@3.9"
brew "glib"
brew "cmake"
brew "direnv"
brew "envchain"
brew "open-mpi"
brew "gdk-pixbuf"
brew "gibo"
brew "git"
brew "guile"
brew "mas"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gobject-introspection"
brew "python@3.8", link: false
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "libheif"
brew "imagemagick"
brew "krb5"
brew "python@3.10", link: false
brew "libfido2"
brew "libgsf"
brew "libproxy"
brew "libxml2"
brew "llvm"
brew "mysql"
brew "mysql-client"
brew "nghttp2"
brew "nkf"
brew "node", link: false
brew "node-build"
brew "nodebrew"
brew "openssl@3"
brew "qt"
brew "poppler"
brew "postgresql@11"
brew "postgresql@14"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "tfenv"
brew "tree"
brew "vips"
brew "volta"
brew "wget"
brew "yarn"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku"
brew "rbenv/tap/openssl@1.0"

cask "chromedriver"
cask "db-browser-for-sqlite"
cask "slack"
cask "google-chrome"
